/**
 * Created by owner on 12.01.2018.
 * 144. Составить программу нахождения наибольшего общего делителя четырех натуральных чисел.

 */
public class Ex144 {
    public static void main(String[] args) {
        int a=4, b=8, c=32, d=12;
        System.out.println(Ex78.nod(Ex78.nod(a,b),Ex78.nod(c,d)));
    }

}
