/**
 * Created by owner on 12.01.2018.
 * 143. Составить программу нахождения наибольшего общего делителя и
 * наименьшего общего кратного двух натуральных чисел                () .

 */
public class Ex143 {
    public static void main(String[] args) {
        int a=14, b=35;
        System.out.println(Ex78.nod(a,b)+" "+Ex78.nok(a,b));

    }
}
