/**
 * Created by owner on 05.03.2018.
 * 203. Дана строка символов, среди которых есть двоеточие (:). Определить, сколько символов ему предшествует.
 */
public class Ex203 {
    public static void main(String[] args) {
        String str =new String("sdlkfjlsk:lksdjflksdj");
        System.out.println(str.indexOf(":"));
    }
}
